In [1]:
%load_ext sql

In [2]:
%sql mysql+mysqlconnector://root:root@localhost/mydb

In [3]:
%%sql
show tables;

 * mysql+mysqlconnector://root:***@localhost/mydb
14 rows affected.

[('customerdata',),
 ('customers',),
 ('customersdetails',),
 ('customertransactions',),
 ('drivers',),
 ('employee_basic_view',),
 ('employees',),
 ('high_employee_details',),
 ('high_paid_employees',),
 ('orders',),
 ('rides',),
 ('rides1',),
 ('rides2',),
 ('users',)]

In [4]:
%%sql
CREATE TABLE Customersdetails (
    id INT PRIMARY KEY,
    customer_name VARCHAR(50),
    email VARCHAR(100),
    city VARCHAR(50),
    phone_number VARCHAR(20)
);

 * mysql+mysqlconnector://root:***@localhost/mydb
(mysql.connector.errors.ProgrammingError) 1050 (42S01): Table 'customersdetails' already exists
[SQL: CREATE TABLE Customersdetails (
    id INT PRIMARY KEY,
    customer_name VARCHAR(50),
    email VARCHAR(100),
    city VARCHAR(50),
    phone_number VARCHAR(20)
);]
(Background on this error at: https://sqlalche.me/e/20/f405)

In [5]:
%%sql
INSERT INTO Customersdetails VALUES
(1, 'Ravi Kumar', 'ravi.kumar@example.com', 'Chennai', '43210'),
(2, 'Priya Sharma', 'priya.sharma@example.com', 'Bangalore', '43211'),
(3, 'Arjun Mehta', 'arjun.mehta@example.com', 'Hyderabad', '43212'),
(4, 'Meena Gupta', 'meena.gupta@example.com', 'Mumbai', NULL),
(5, 'Karthik Raj', 'karthik.raj@example.com', 'Chennai', '43213');

 * mysql+mysqlconnector://root:***@localhost/mydb
(mysql.connector.errors.IntegrityError) 1062 (23000): Duplicate entry '1' for key 'customersdetails.PRIMARY'
[SQL: INSERT INTO Customersdetails VALUES
(1, 'Ravi Kumar', 'ravi.kumar@example.com', 'Chennai', '43210'),
(2, 'Priya Sharma', 'priya.sharma@example.com', 'Bangalore', '43211'),
(3, 'Arjun Mehta', 'arjun.mehta@example.com', 'Hyderabad', '43212'),
(4, 'Meena Gupta', 'meena.gupta@example.com', 'Mumbai', NULL),
(5, 'Karthik Raj', 'karthik.raj@example.com', 'Chennai', '43213');]
(Background on this error at: https://sqlalche.me/e/20/gkpj)

In [6]:
%%sql 
select * from customersdetails

 * mysql+mysqlconnector://root:***@localhost/mydb
5 rows affected.

[(1, 'Ravi Kumar', 'ravi.kumar@example.com', 'Chennai', '43210'),
 (2, 'Priya Sharma', 'priya.sharma@example.com', 'Bangalore', '43211'),
 (3, 'Arjun Mehta', 'arjun.mehta@example.com', 'Hyderabad', '43212'),
 (4, 'Meena Gupta', 'meena.gupta@example.com', 'Mumbai', None),
 (5, 'Karthik Raj', 'karthik.raj@example.com', 'Chennai', '43213')]

In [7]:
%%sql # Length function
select length (customer_name) as name_length,
char_length(customer_name) as Char_len
from customersdetails

 * mysql+mysqlconnector://root:***@localhost/mydb
5 rows affected.

[(10, 10), (12, 12), (11, 11), (11, 11), (11, 11)]

In [8]:
%%sql # Upper and Lower cas3
SELECT Id,
       customer_name,
       UPPER(customer_name) AS name_upper,
       LOWER(customer_name) AS name_lower
FROM Customersdetails;

 * mysql+mysqlconnector://root:***@localhost/mydb
5 rows affected.

[(1, 'Ravi Kumar', 'RAVI KUMAR', 'ravi kumar'),
 (2, 'Priya Sharma', 'PRIYA SHARMA', 'priya sharma'),
 (3, 'Arjun Mehta', 'ARJUN MEHTA', 'arjun mehta'),
 (4, 'Meena Gupta', 'MEENA GUPTA', 'meena gupta'),
 (5, 'Karthik Raj', 'KARTHIK RAJ', 'karthik raj')]

In [9]:
%%sql
-- Join name + city into one string
SELECT 
    customer_name,
    city,
    CONCAT(customer_name, ' from ', city) AS full_info
FROM Customersdetails;

 * mysql+mysqlconnector://root:***@localhost/mydb
5 rows affected.

[('Ravi Kumar', 'Chennai', 'Ravi Kumar from Chennai'),
 ('Priya Sharma', 'Bangalore', 'Priya Sharma from Bangalore'),
 ('Arjun Mehta', 'Hyderabad', 'Arjun Mehta from Hyderabad'),
 ('Meena Gupta', 'Mumbai', 'Meena Gupta from Mumbai'),
 ('Karthik Raj', 'Chennai', 'Karthik Raj from Chennai')]

In [10]:
%%sql
-- Combine values with a separator, skipping NULL phone_number
SELECT 
    CONCAT_WS(' | ', customer_name, email, phone_number) AS details
FROM Customersdetails;

 * mysql+mysqlconnector://root:***@localhost/mydb
5 rows affected.

[('Ravi Kumar | ravi.kumar@example.com | 43210',),
 ('Priya Sharma | priya.sharma@example.com | 43211',),
 ('Arjun Mehta | arjun.mehta@example.com | 43212',),
 ('Meena Gupta | meena.gupta@example.com',),
 ('Karthik Raj | karthik.raj@example.com | 43213',)]

In [11]:
%%sql
-- Extract parts of strings
SELECT
    customer_name,
    SUBSTRING(customer_name, 1, 4) AS first_4_letters,
    LEFT(city, 3) AS city_first3,
    RIGHT(phone_number, 2) AS last_2_digits
FROM Customersdetails;

 * mysql+mysqlconnector://root:***@localhost/mydb
5 rows affected.

[('Ravi Kumar', 'Ravi', 'Che', '10'),
 ('Priya Sharma', 'Priy', 'Ban', '11'),
 ('Arjun Mehta', 'Arju', 'Hyd', '12'),
 ('Meena Gupta', 'Meen', 'Mum', None),
 ('Karthik Raj', 'Kart', 'Che', '13')]

In [12]:
%%sql
-- Replace email domain
SELECT
    email,
    REPLACE(email, '@example.com', '@gmail.com') AS updated_email
FROM Customersdetails;

 * mysql+mysqlconnector://root:***@localhost/mydb
5 rows affected.

[('ravi.kumar@example.com', 'ravi.kumar@gmail.com'),
 ('priya.sharma@example.com', 'priya.sharma@gmail.com'),
 ('arjun.mehta@example.com', 'arjun.mehta@gmail.com'),
 ('meena.gupta@example.com', 'meena.gupta@gmail.com'),
 ('karthik.raj@example.com', 'karthik.raj@gmail.com')]

In [13]:
%%sql
-- Remove spaces from city names
SELECT
    city,
    TRIM(city) AS trim_city,# IT removes empty spaces from the column, checks both side
    LTRIM(city) AS left_trim,# it also does the same but check space only in left
    RTRIM(city) AS right_trim# it also does the same but check space only in right
FROM Customersdetails;

 * mysql+mysqlconnector://root:***@localhost/mydb
5 rows affected.

[('Chennai', 'Chennai', 'Chennai', 'Chennai'),
 ('Bangalore', 'Bangalore', 'Bangalore', 'Bangalore'),
 ('Hyderabad', 'Hyderabad', 'Hyderabad', 'Hyderabad'),
 ('Mumbai', 'Mumbai', 'Mumbai', 'Mumbai'),
 ('Chennai', 'Chennai', 'Chennai', 'Chennai')]

In [14]:
%%sql
-- Find position of '@' in emails
SELECT
    email,
    LOCATE('@', email) AS at_position
FROM Customersdetails;

 * mysql+mysqlconnector://root:***@localhost/mydb
5 rows affected.

[('ravi.kumar@example.com', 11),
 ('priya.sharma@example.com', 13),
 ('arjun.mehta@example.com', 12),
 ('meena.gupta@example.com', 12),
 ('karthik.raj@example.com', 12)]

In [15]:
%%sql
-- Get customers whose name starts with 'A'
SELECT * # LIke (pattern search)
FROM Customersdetails
WHERE customer_name LIKE 'A%' # the percentage states anything comes after A is not matter but i need the word from A 
/* 
    %   = matches ANY number of characters
    'A%'   = starts with A
    '%A'   = ends with A
    '%A%'  = contains A anywhere
    '_A%'  = second letter is A ( _ = matches exactly one character )
*/

 * mysql+mysqlconnector://root:***@localhost/mydb
1 rows affected.

[(3, 'Arjun Mehta', 'arjun.mehta@example.com', 'Hyderabad', '43212')]